'use client'
import React from 'react'
import Image from 'next/image'

const page = () => {

  const latestNews = [
    // {
    //   title: "नई शिक्षा नीति को मिली, केन्द्रीय कैबिनेट की मंजूरी।",
    //   description: "Kolhan Model Public School which is going to be established this year 2024 under the directorship of …………………., This School is primarily focused to give quality education",
    //   link: "/LatestNews",
    //   image: ""
    // },
    {
      title: "Parent Teacher Meeting",
      description: "23 दिसम्बर  का PTM  meeting  का विडिओ  KMPS  के हमारे बच्चों  की प्रगति बहुत सराहनीय  है,  जो निश्चित ही प्राचार्य श्री राजेन्द्र बोदरा जी,  श्री योगेन्द्र मुंडरी  जी , शिक्षिकाएँ और स्कूल स्टाफ के मेहनत का नतीजा है । निसंदेह  हमारे  बच्चे भी कुछ  अच्छा करने की दिशा में प्रयासरत रहते हैं । हमें पूरी उम्मीद है KMPS  अपने लक्ष्य  को जरूर प्राप्त करेगा। लक्ष्य प्राप्ति तक  हमें भी नहीं रुकना है , उसके बाद  नये नये लक्ष्य की ओर  कदम बढ़ाना है.....इन्हीं आशाओं के साथ  आप सभी को जोहार  🙏🙏🙏 PTM  Meeting में उपस्थित सभी प्रबुद्ध जनों का धन्यवाद  🙏🙏💐",
      description2: "Hamare respected KMPS Principal shri Rajendra Bodra ji ka contribution school ke performance me  atti prasansnia hai and KMPS is getting the results of his rich experience as Principal in KVS, Jamshedpur. 👍🙏",
      link: "/LatestNews"
    },
    {
      title: "",
      description: "अशिक्षा की वजह से हमारे गांवों की जनसंख्या घट रही है, कोरोना वायरस की वजह से एक मौत नहीं हुई, मगर मलेरिया, दस्त, तपेदिक की वजह से मौतें ज्यादा होती हैं । जब वो अस्पताल जाते तो communication नहीं कर पाते,उनकी मौत की वजह गलत इलाज होती है। हमारे खानदान द्वारा दी गई जमीन पर स्कूल की स्थापना हुई मगर छात्र ने होने की वजह से अन्य गांव में समाहित कर दिया गया। अफसोस होता है कि विद्यालय नहीं रह गया। जनसंख्या घट क्यूं रही है,? पलायन । वैसे गांव में २० ऋण लोगों से ज्यादा लोग हिंदी समझ और बोल नहीं सकते। अजीब तर्क है हमारे देश में, सुना तो होगा ,इसके विपरीत जापान में एक विद्यार्थी ही था, ट्रेन को रूकना पड़ा और स्टेशन भी बंद नहीं किया गया। Quality education required,all the administrator are concentrating on data. Actual we are always in loss side, business man wants more minning of minerals,they are purchasing carbon credit    of our area, that means we are allowing the company to make more production or more manufacturing or more pollution or increase in carbon emission. Companies are not fool. They are distributing bulbs, blankets by help of their organisations . If they are giving you help of rupees hundred that means definitely they earning more than thousand. If they are  telling the truth directly, no one will agree to receive the gifts by these gifts. Our people are needy.  There are two posters one poster belongs to S R Rungta group and another belongs to Tata groups. If I'm not wrong both the companies are making lot of profits.  By sake  of Adivasi ho samaj mahasabha they are just making us handicaf or we are signing the agreement or contract to explore the Kolhan more. Our Kolhan was full of minerals . No one is opposing them because they don't know what they are accepting. Education is must but it should be quality education not quantity education. Keep your eyes open . History repeats. Before 1947, rule of Britishers or east india company now also compines or Indians . Till we don't have house of bricks,we can see. Where is our government ? How many years over after Independence ? We have to identify the corporate agents. बुद्धिमानों के लिए इशारा ही काफी है कि मैं क्या कहना चाहता हूं ? झारखंड आज भी गुलामी में जी रहा है आप कब शिक्षित होईगा ? यही कड़वा सच है। बस नये राजा आ गये हैं।  शिक्षा ही इसका इलाज और उपाय है। हमें जनप्रतिनिधियों से पूछना चाहिए कि झारखंड बनने के बाद कितने स्कूल, कालेज खोले गए हैं ? क्या हमें कोल्हान का विकास इस प्रकार करोगे ? वीडियो में विकास दिखाई दे रहा है । तस्वीरें हकीकत बयां कर रही हैं। हमारे भी घर ऐसे ही हैं , ये हमारे घर हैं।  विकास की दौड़ में हम बहुत पीछे हैं यही हकीकत है।  एक स्कूल, काॅलेज हमारा नहीं है    जो परचम लहरा रहा हो ।  चलिए मिलजुल कर लोगों को शिक्षित करते  हैं । स्कूलों हाजिरी बढ़ेगी। बच्चों को स्कूल भेजा जाये। ये संदेश दूर -दूर तक जाना चाहिए। हमारे अध्यक्ष महोदय की बातें सच है कि 40 बच्चों पर एक शिक्षक की नियुक्ति होती है। शहरों में जनसंख्या बढ़ रही है मगर गांव घट रही है। मजबूरी में ही सरकारी स्कूल में भेजते हैं। हम बच्चों को शहर के विद्यालयों में भेज देते हैं तो गांव के विद्यालयों में पढ़ने के लिए बच्चे कहां से लायेंगे ? मैंने शुरुआत में कहा था विभाग आंकड़ों पर चलता है। आंकड़ों को सुधारने के लिए गांव की ओर लौटो यही सरकारी तरीका है। जबकि होना ये चाहिए कि बस  कब चलती है जब उसमें इंजन हो, चक्के हों, जगह हों , सभी कल-पुर्जे सही-सलामत हों, सभी चीजों का अपना महत्त्व है, नहीं तो पानी डाल कर ठंडा करो और धक्के लगा स्टार्ट करो। ड्राइवर,खलासी, कंडक्टर का अपना महत्त्व है। ये बेसिक चीजें हैं। स्कूल की तुलना मैं बस से करता हूं। जिस प्रकार बस/कार का चलना उस की कम सवारियों पर निर्भर नहीं करता है। बशर्ते आप आर्थिक पहलू को नजर अंदाज कर दें। ये अलग बात है ओवरलोड की समस्या आ सकती है। आप देख सकते हैं हम भी जिम्मेदार हैं रूकी हुई विकास के लिए क्योंकि हम बच्चों को सरकारी स्कूलों में नहीं भेजते हैं। अधिकतर सरकारी विभागों कार्यरत लोगों के बच्चे भी गैर सरकारी स्कूलों में ही पढ़ाई करते हैं। सबसे अच्छे शिक्षक सरकारी स्कूलों में होते हैं। बातें बहुत हो गईं चलिए जोरदार प्रदर्शन कर लिया जाए आबुवा स्कूल के माध्यम से। आबुवा स्कूल से पहला बैच कब निकलेगा ? कैसे निकलेंगे ? Quality or Quantity Wait and watch ! Definitely quality ही deliver करना है, at any cost....... 🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼 जोहारगे सबिनको बुगितेगे बु टईयोका। ",
      link: "/LatestNews"
    },
    {
      title: "",
      description: "आदिवासी समाज को स्वस्थ, शिक्षित, और सांस्कृतिक रूप से संपन्न होना चाहिए। इसके लिए निम्नलिखित बिंदुओं पर ध्यान दिया जाना चाहिए : शिक्षा : सभी बच्चों को गुणवत्तापूर्ण शिक्षा मिलनी चाहिए ताकि वे अपने भविष्य को संवार सकें और समाज को प्रगति पर ले जा सकें। स्वास्थ्य : स्वास्थ्य सुविधाओं की आसान पहुँच होनी चाहिए। साफ पानी, पोषणयुक्त आहार और स्वच्छता के प्रति जागरूकता होनी चाहिए। आर्थिक स्वावलंबन : रोजगार के अवसर और स्वरोजगार के साधन उपलब्ध होने चाहिए। संस्कृति और परंपरा : सांस्कृतिक धरोहर और परंपराओं का संरक्षण और संवर्धन किया जाना चाहिए। भाषा, नृत्य, संगीत और त्यौहारों को प्रोत्साहित किया जाना चाहिए। सामाजिक न्याय: सभी को समान अधिकार मिलने चाहिए और भेदभाव रहित समाज का निर्माण होना चाहिए। भूमि अधिकार और अन्य कानूनी अधिकारों के प्रति सजग होना चाहिए। प्राकृतिक संसाधनों का संरक्षण: आदिवासी समुदायों को उनके प्राकृतिक संसाधनों पर अधिकार मिलना चाहिए और लेना चाहिए और उनके संरक्षण के लिए उचित कदम उठाए जाने चाहिए। इन सभी पहलुओं पर ध्यान देकर आदिवासी समाज को मजबूत, स्वाभिमानी और आत्मनिर्भर बनाया जा सकता है। आज के समय ज्यादातर गाँव में हमारे मुख्यगण या कर्ताओं  से निवेदन है कि आप सभी का सम्मिलित प्रयास उपरोक्त बिंदुओं पर आधारित होना चाहिए। 1) शिक्षा के महत्व को आज के दिन किए व्यक्ति या समाज को समझाने की आवश्यकता नहीं है। सभी समाज और व्यक्ति इसके प्रति भली भांति जागरूक हैं लेकिन आज भी हमारे समाज में शिक्षा को मुख्यत से सामाजिक कार्यक्रम में शामिल नहीं किया गया है। क्योंकि खेल और अन्य कार्यक्रम के लिए समाज से आवश्यक रूप से घर घर से चंदा लिया जाता है लेकिन शिक्षा के नाम पर 1 रुपया भी कभी सामाजिक तौर से इकट्ठा नहीं किया गया है। यह दर्शाता है कि शिक्षा के महत्व को जानते हुए भी सामाजिक तौर से स्वीकार नहीं किया गया है। इसलिए आप सभी मुख्यगण या कर्ताओं से  निवेदन है शिक्षा को सामाजिक रूप से जोड़ने और शिक्षा के प्रति रुझान बढ़ाने के लिए प्रत्येक घर से शिक्षा के नाम पर कम से कम 1रुपया या न्यूनतम राशि प्रत्येक घर से अवश्य संग्रहित किया जाए और गाँव में उपलब्ध school या लाइब्रेरी में खर्च किया जाए। साप्ताहिक या मासिक बैठक में शिक्षा में किए जाने वाले खर्च का ब्यौरा दिया जाए। हमारी नई पीढ़ी में रीति- रिवाज  और संस्कृति के प्रति रुझान बढ़ाने में प्रयास किया जाना है। जो समाज अपनी रीति रिवाज और संस्कृति से जुड़ी रहती उसी समाज में सामाजिक एकता और संस्कार सुरक्षित रहता है। इसलिए यह निवेदन है कि सभी पीढ़ या ग्राम में सांस्कृतिक केंद्र खोलने की आवश्यकता है जिसमें साप्ताहिक तौर पर संस्कृति से जुड़ी कार्यक्रम किया जा सकता है। इसके लिए केंदीय रूप से समिति गठित कर किया जाए। जो इन सभी मामले देखकर  सलाह दे और और अनुमोदन पर कार्यवाही करे।",
      link: "/LatestNews"
    },
    {
      title: "",
      description: "In continuation to it and experiencing the turbulence of Teachers and other KMPS staff availability, let us invite applications for Teachers, Nurse,Security guards and Cooks for conducting selection interview in the month of January after 20th,2025 so that we are empowered with selected ones in advance to cater to the enhanced needs from April onwards when the new session with more students starts.It is essential, important and unavoidable to run the KMPS smoothly with a single objective to achive all round quality education.🙂",
      link: "/LatestNews"
    },
  ]

  // const latestNewsContent = latestNews.map((news, index) => (
  //   <div key={index} className="w-full border-2 border-slate-500 rounded-md bg-slate-100 px-20 py-10 text-center lg:w-[40%]">
  //     <h3 className="text-2xl font-bold mb-8 text-red-800">
  //       {news.title}
  //     </h3>
  //       <p className="mb-10">
  //         {news.description}
  //       </p>
  //     {/* <p className="text-lg mb-8">{news.description}</p> */}
  //   </div>
  // ));

  return (
    <section className="relative flex flex-col justify-center items-start">
      <div className='grid place-content-center w-full h-[200px] bg-slate-300 mt-[80px]'>
            <p className='text-6xl font-black text-slate-800'>Latest News</p>
        </div>
    {/* <div className="relative flex flex-col justify-center items-center w-full h-full bg-white">
      
      <div className="relative flex gap-2 justify-center py-16">
        <div className="relative flex flex-col-reverse  flex-wrap gap-6 lg:gap-8 justify-center items-center h-full px-20 md:py-10 lg:flex-row md:items-center">
          <div className="w-full lg:w-[50%] flex flex-col justify-center items-center text-center lg:text-left lg:items-start">
            <p className="text-xl font-bold">Primary & Secondary School</p>
            <h2 className="text-4xl leading-9 md:text-7xl md:leading-[1] lg:text-3xl xl:text-6xl font-black mb-4 text-green-800">
              KOLHAN MODEL PUBLIC SCHOOL
            </h2>
            <h3 className="text-2xl lg:text-lg xl:text-2xl font-bold mb-8">(Co-ed 10+2 English Medium School)
            - A Unit of KECS, Reg No: 154/2023 -</h3>
            <p className="text-lg lg:text-sm xl:text-lg mb-8">Kolhan Model Public School which is going to be established this year 2024 under the directorship of …………………., This School is primarily focused to give quality education to our young stydents of our state Jharkhand, and empower them with all the necessary requirements, so that they can develop themselves in any field of career building….</p>
            <div className="mb-16 lg:mb-8 xl:mb-16">
              <table>
                <thead>
                  <tr>
                    <th className="text-2xl font-bold">Our School is Facilitated With</th>
                  </tr>
                </thead>
                <tbody>
                  <tr>
                    <td>Library</td>
                  </tr>
                  <tr>
                    <td>Computer Lab</td>
                  </tr>
                  <tr>
                    <td>Science Lab</td>
                  </tr>
                </tbody>
              </table>
            </div>
            <Link className="relative bg-green-800 px-20 py-4 rounded-md text-white mt-8 lg:mt-1 hover:bg-green-900" href="/about"> Know More </Link>
          </div>
          <div className="grid place-items-center w-full h-full md:w-[60%] xl:w-[40%]">
              <Image
                className="object-contain w-[80%] h-[80%] lg:w-[80%] lg:h-[80%]"
                src="/images/logo/school_logo.png"
                alt="KMPS School Image"
                width={500}
                height={250}
              />
          </div>
        </div>
      </div>
    </div> */}

<section className="relative flex flex-col justify-center items-start">

<div className="relative flex gap-2 justify-center bg-slate-50 py-16 w-full">
    <div className="relative flex flex-wrap gap-20 md:gap-32 lg:gap-14 justify-center items-center w-full h-full px-20 md:flex-row md:items-center">
      <div className="w-full border-2 border-slate-500 rounded-md bg-slate-100 px-20 py-10 text-center lg:w-[80%]">
              <div>
                <Image
                  className='object-contain w-full'
                  src="/images/latestNews/admissionOpen.jpeg"
                  alt="Holiday List"
                  width={600}
                  height={300}
                />
              </div>
            
      </div>
    </div>
  </div>

  <div className="relative flex gap-2 justify-center bg-slate-50 py-16">
    <div className="relative flex flex-wrap gap-20 md:gap-32 lg:gap-14 justify-center items-center h-full px-20 md:flex-row md:items-center">
      <div className="w-full border-2 border-slate-500 rounded-md bg-slate-100 px-20 py-10 text-center lg:w-[80%]">
        <h3 className="text-2xl font-bold mb-8 text-red-800">
          नई शिक्षा नीति को मिली, केन्द्रीय कैबिनेट की मंजूरी।
        </h3>

        <p className="mb-10">
          भारत सरकार द्वारा प्रस्तावित केन्द्रीय सरकार की कैबिनेट की स्वीकृति के बाद 36 साल बाद देश में नई शिक्षा नीति लागू हो गई । कैबिनेट ने नई शिक्षा नीति (New Education Policy 2023) को हरी झंडी दे दी है. 34 साल बाद शिक्षा नीति में बदलाव किया गया है. नई शिक्षा नीति की उल्लेखनीय बातें सरल तरीके की इस प्रकार हैं:
          </p>

        <div className="flex gap-8 justify-center">
                  <dl>
                    <dt><h3 className='text-xl font-bold text-slate-800 mb-3'>Five Years Fundamental</h3></dt>
                    <dd>
                      <ol>
                        <li>
                          Nursery @ 4 Years
                        </li>
                        <li>
                          Jr KG @ 5 Years
                        </li>
                        <li>
                          Sr KG @ 6 Years
                        </li>
                        <li>
                          Std 1st @ 7 Years
                        </li>
                        <li>
                          Std 2nd @ 8 Years
                        </li>
                      </ol>
                    </dd>
                  </dl>
                  <br/>

                  <dl>
                    <dt className="pl-1"><h3 className='text-xl font-bold text-slate-800 mb-3'>Three Years Preparatory</h3></dt>
                    <dd>
                      <ol>
                        <li>
                          Std 3rd @ 9 Years
                        </li>
                        <li>
                          Std 4th @10 Years 
                        </li>
                        <li>
                          Std 5th @11 Years 
                        </li>
                      </ol>
                    </dd>
                  </dl>
                  <br/>

                  <dl>
                    <dt className="pl-1"><h3 className='text-xl font-bold text-slate-800 mb-3'>Three Years Middle</h3></dt>
                    <dd>
                      <ol>
                        <li>
                          Std 6th @ 12 Years
                        </li>
                        <li>
                          Std 7th @ 13 Years
                        </li>
                        <li>
                          Std 8th @ 14 Years
                        </li>
                      </ol>
                    </dd>
                  </dl>
                  <br/>

                  <dl>
                    <dt className="pl-1"><h3 className='text-xl font-bold text-slate-800 mb-3'>Four Years  Secondary</h3></dt>
                    <dd>
                      <ol>
                        <li>
                          Std 9th @ 15 Years 
                        </li>
                        <li>
                          Std SSC @ 16 Years 
                        </li>
                        <li>
                          Std FYJC @ 17Years 
                        </li>
                        <li>
                          STD SYJC @18 Years
                        </li>
                      </ol>
                    </dd>
                  </dl>
                  <br/>
                </div>

          <p className="flex flex-col  mb-2 pr-4">
            <h3 className='text-xl font-black mt-10 mb-6'>खास बातें :</h3>
            <br/>
            <ul className="text-left mb-6">
              <li>
                {"#-> केवल 12वीं क्‍लास में होगा बोर्ड"}
              </li>
              <li>
                {"★-> MPhil होगा बंद, कॉलेज की डिग्री 4 साल की"}
              </li>
              <li>
                {"■-> 10वीं बोर्ड खत्‍म."}
              </li>
              <li>
                {"◆-> अब 5वीं तक के छात्रों को मातृ भाषा, स्थानीय भाषा और राष्ट्र भाषा में ही पढ़ाया जाएगा. बाकी विषय चाहे वो अंग्रेजी ही क्यों न हो, एक सब्जेक्ट के तौर पर पढ़ाया जाएगा।"}
              </li>
              <li>
                {"●-> पहले 10वी बोर्ड की परीक्षा देना अनिवार्य होता था, जो अब नहीं होगा."}
              </li>
              <li>
                {"★-> 9वींं से 12वींं क्लास तक सेमेस्टर में परीक्षा होगी. स्कूली शिक्षा को 5+3+3+4 फॉर्मूले के तहत पढ़ाया जाएगा।"}
              </li>
              <li>
                {"■-> वहीं कॉलेज की डिग्री 3 और 4 साल की होगी. यानि कि ग्रेजुएशन के पहले साल पर सर्टिफिकेट, दूसरे साल पर डिप्‍लोमा, तीसरे साल में डिग्री मिलेगी.।"}
              </li>
              <li>
                {"◆-> 3 साल की डिग्री उन छात्रों के लिए है जिन्हें हायर एजुकेशन नहीं लेना है. वहीं हायर एजुकेशन करने वाले छात्रों को 4 साल की डिग्री करनी होगी. 4 साल की डिग्री करने वाले स्‍टूडेंट्स एक साल में  MA कर सकेंगे."}
                {"●-> MA के छात्र अब सीधे PHD कर सकेंगे."}
              </li>
                <li>
                    {"★-> स्‍टूडेंट्स बीच में कर सकेंगे दूसरे कोर्स. हायर एजुकेशन में 2035 तक ग्रॉस एनरोलमेंट रेशियो 50 फीसदी हो जाएगा. वहीं नई शिक्षा नीति के तहत कोई छात्र एक कोर्स के बीच में अगर कोई दूसरा कोर्स करना चाहे तो पहले कोर्स से सीमित समय के लिए ब्रेक लेकर वो दूसरा कोर्स कर सकता है."}
                </li>
                <li>
                    {"■-> हायर एजुकेशन में भी कई सुधार किए गए हैं. सुधारों में ग्रेडेड अकेडमिक, ऐडमिनिस्ट्रेटिव और फाइनेंशियल ऑटोनॉमी आदि शामिल हैं. इसके अलावा क्षेत्रीय भाषाओं में ई-कोर्स शुरू किए जाएंगे. वर्चुअल लैब्स विकसित किए जाएंगे. एक नैशनल एजुकेशनल साइंटफिक फोरम (NETF) शुरू किया जाएगा. बता दें कि देश में 45 हजार कॉलेज हैं."}
                </li>
                <li>
                    {"●-> सरकारी, निजी, डीम्‍ड सभी संस्‍थानों के लिए होंगे समान नियम।"}
                  </li>
              </ul>
              <ul className='text-left'>
                <li>
                  धर्मेंद्र प्रधान
                </li>
                <li>
                  शिक्षा मंत्री
                </li>
                <li>
                  भारत सरकार
                </li>
              </ul>
              <br/>
          </p>
        {/* <p className="text-lg mb-8">{news.description}</p> */}
      </div>
    </div>
  </div>
  {latestNews.map((news, index) => (
  <div key={index} className="relative flex gap-2 justify-center bg-slate-50 py-16">
    <div className="relative flex flex-wrap gap-20 md:gap-32 lg:gap-14 justify-center items-center h-full px-20 md:flex-row md:items-center">
      <div className="w-full border-2 border-slate-500 rounded-md bg-slate-100 px-20 py-10 text-center lg:w-[80%]">
          
              <div>
                <h3 className="text-2xl font-bold mb-8 text-red-800">
                  {news.title}
                </h3>
                <p className="mb-10">
                  {news.description}
                </p>
                <p className="text-lg mb-4">{news.description2 ? news.description2 : ''}</p>
                
              </div>
            
      </div>
    </div>
  </div>
  ))}
</section>

  <div className="relative flex gap-2 justify-center bg-slate-50 py-16 w-full">
    <div className="relative flex flex-wrap gap-20 md:gap-32 lg:gap-14 justify-center items-center w-full h-full px-20 md:flex-row md:items-center">
      <div className="w-full border-2 border-slate-500 rounded-md bg-slate-100 px-20 py-10 text-center lg:w-[80%]">
              <div>
                <Image
                  className='object-contain w-full'
                  src="/images/latestNews/holidayList.jpeg"
                  alt="Holiday List"
                  width={600}
                  height={300}
                />
              </div>
            
      </div>
    </div>
  </div>
</section>
  )
}

export default page
